package com.hillel.lesson12.homework;

public class Main {
    /*Выполните все пункты как одно решение задачи:

    Создайте 3 класса, в каждом из которых будет по одному методу с разным названием(Остальное не имеет значения);

    Создайте Список(List);

    Создайте метод, который будет принимать и возвращать Список, и проводить с ним следующе итерации:
    а). Если список пустой, добавьте в него 6 объектов 1го Вашего класса;
    б). После добавьте в начало списка 3 объекта 2го Вашего класса;
    в). После замените последние 3 элемента списка на 3 объекта 3го Вашего
    класса;

    Создайте второй метод, который на вход будет принимать Список и возвращать список и
    будет выполнять следующую логику: Проверять количество экземпляров класса в принятом Списке
    и оставлять только по 2 экземпляра каждого из 3 Ваших классов(то есть, 6 объектов в сумме).*/

    public static void main(String[] args) {
    }
}
